1. 지원 동기와 입사 후 목표


제가 어빌리티 시스템즈에 지원하게 된 이유는 제 강점 역량인 로봇 미들웨어 및 응용애플리케이션 개발 경험이 직무에 맞기 때문입니다. 어빌리티 시스템즈의 주력 사업인 실내 안내 서비스는 ROS, Navigation, 센서 측위 기술 등을 요구합니다. 저는 LLM 기반 실내 안내로봇 졸업 프로젝트와 자율운항대회를 통해 라이다 및 비전을 통한 실내/외 자율주행 프로젝트를 경험했고, 기록 분석 및 성능 최적화 작업을 통해 KABOAT 2023년 대회 완주 실패에서 2024년 대회 9위 성적을 얻은 경험이 있습니다. 로그 분석과 알고리즘 최적화를 통한 발전 경험을 통해 회사의 성장에 이바지할 수 있다고 생각합니다. 

그뿐만 아니라 어빌리티 시스템즈이 요구하는 분야인 App, UI/UX, ROS, IoT, AI, Vision, Navigation 등 전반적인 모든 분야에서 프로젝트를 진행해 봤고, Robot/Vision 연구실에서 경험을 쌓았기 때문에 어떤 직무에서도 역할을 충분히 할 수 있습니다. 

이를 기조로 저는 어빌리티 시스템즈을 스마트시티 시장에서 글로벌 경쟁력을 가질 수 있는 회사로 성장시키고 싶습니다. 저는 스마트제조ICT를 복수전공하며 물류, 공장 등의 스마트화 중요성을 공부하고 이 분야의 전문가가 되기를 꿈꿨습니다. 회사가 추가하는 바와 제 목표가 동일하기 때문에 어빌리티 시스템즈에서 제 전문성을 키우며 노력한다면 회사의 스마트시티 시장 진출 및 확장에 크게 도움이 될 수 있다고 생각합니다.


2.성장 과정


중학교 때부터 컴퓨터공학에 관심을 가지며 C언어 등의 언어를 독학했습니다. 개발을 하고 그 결과물을 보는 것이 뿌듯하고 성취감을 주었기 때문입니다. 대학교 1학년 때는 친구들과 IoT 개발 대회에 참가했는데 우수상이란 성적을 얻으면서 개발자로서의 자신감을 얻었습니다. 가장 좋아하는 분야는 AI 및 로봇 개발입니다. 대학교 2학년 때 친구들과 소프트웨어 경진대회에 참가해 킥보드 안전모 확인 소프트웨어를 만들려고 노력하면서 처음 경험해 보았습니다. 다 같이 의기투합해 참여했으나 Pytorch, Tensorflow, CUDA 등의 생소한 기술과 오픈소스 코드를 보면서 많은 어려움을 느꼈고, 결국 개발에 실패하고 말았습니다.

하지만 이런 분야도 있었다는 것을 알게 되었으며 그 실패를 발판 삼아 3학년 로봇비전 연구실에 들어가서 비전 AI와 자율주행 등에 흥미를 가지며 공부했습니다. 이후 대회에 지속해서 참여하면서 저 스스로 실력을 키웠습니다. 웹, 모바일, 로봇 소프트웨어, AI 개발 등 여러 부분에서 부족하지만, 경험을 가지고 있고, 언어나 프레임워크 외적으로도 버전 관리나 협업을 위해 깃허브나 슬랙 등을 다루어 보았습니다.

가장 어려웠던 프로젝트는 졸업 작품이었던 SoftBank의 Pepper라는 휴머노이드 로봇을 활용한 안내 로봇 시스템이었습니다. SLAM, 자율주행, ROS, LLM 등 고난도 기술이 요구되었고, 로봇의 생명 주기부터 프로세스 처리, 상호작용 등 복잡한 개발 과정이 필요했습니다. 반년 동안 학교에 남아 로봇 소프트웨어 개발에 치중했습니다. 배움의 과정부터 시작한 개발이었기 때문에 수많은 에러 사항이 있었던 것 같습니다. 실존하는 로봇을 코딩해 정상 작동시키는 것은 생각보다 훨씬 어렵다는 것을 알게 되었습니다.

하지만 프로젝트가 점점 완성되어 가는 과정을 보면서 저 자신이 자랑스러웠고, 더 잘 만들어보고 싶다는 욕심도 생겼습니다. 포기하지 않았고 끝까지 도전했고, 결국 발표가 얼마 남지 않은 시점에 개발을 완료했습니다.

발표 후, 교수님은 우리가 만든 프로젝트를 감명 깊게 보고 청소년과 일반인들이 참여하는 오픈 캠퍼스 축제에 작품을 전시하고 싶다고 하셨습니다. 우리는 이 프로젝트를 실제로 일반인들에게 선보이며 피드백을 받았습니다. 그 과정에서 보람도 느꼈지만, 소음과 같은 환경적인 요소에 대한 고민이 충분하지 않았다는 것을 알게 되었습니다. 하지만 이런 경험 또한 앞날에 보탬이 되었다고 생각합니다.

오랫동안 다양한 프로젝트를 경험하면서 저는 개발이란 끝까지 책임을 지는 것이라고 생각하게 되었습니다. 또한 개발은 끝없는 공부이며 또한 끊임없이 에러를 해결해 가는 과정이라 생각합니다. 부족한 부분은 스스로 공부하며 어떻게든 해결 방안을 찾는 방법을 배웠습니다. 책임지고, 끊임없이 공부하며, 어떻게든 답을 찾아내는 개발자 여동현이 되겠습니다.



3. 성격의 장단점



저는 부담감을 많이 느끼는 성격입니다. 이 부담감은 저에게 장점이자 단점입니다. 어떤 일이 주어지면 '반드시 성공적으로 끝내야 한다'는 생각이 강해서 쉽게 마음을 놓지 못합니다. 일례로, 해커톤 대회는 42시간 동안 진행되는데, 저는 모든 개발이 끝나기 전까지 잠시도 눈을 붙이지 못했습니다. 마무리하지 못했다는 찜찜함과 완성도에 대한 압박이 차라리 끝내고 쉬는 게 낫겠다는 생각을 주기 때문입니다. 마감이 다가오는 장기 프로젝트에서도 하루 종일 자리에서 일어나지 않고 작업한 적이 여러 번 있습니다.

이런 성격은 개인적으로 스트레스와 피로를 주기도 하지만, 프로젝트 완수 측면에서는 분명 강점이 되었다고 생각합니다. 개발 도중 오류가 발생하거나 예기치 못한 문제가 생겼을 때, 저는 반드시 해결해야만 마음이 놓이기 때문에 끝까지 해결책을 찾아내려고 노력합니다. 이 덕분에 여러 프로젝트에서 포기하거나 미완성으로 결과물을 발표하는 경우는 없었습니다.

다만, 이 부담감 때문에 새로운 일을 맡을 때 스스로 주저하는 모습을 보일 때가 있습니다. 어떤 일을 시작하는 순간부터 책임감과 함께 오는 부담감을 잘 알기 때문입니다. 그럼에도, 저는 대부분의 프로젝트에서 리더 역할을 맡아왔고, 필요한 순간에는 나서서 기꺼이 부담감을 짊어지었습니다. 분명 단점도 있으나, 그 단점을 인지하고 있으며 긍정적인 원동력을 삼기 위해 노력하고 있습니다. 저는 이러한 성향을 잘 관리하며 앞으로도 복잡하고 어려운 과정이 있어도 끝까지 문제를 해결하고 나아가는 개발자가 되고자 합니다.



4. 직무 관련 경험 및 역량

남들과 차별화된 강점은 끊임없는 도전입니다. 저는 제 실력을 상승시키기 위해 대학교 4년 동안 빠짐없이 대회에 출전했으며, 전문성을 가지기 위해 Robot/Vision 연구실에서 2년 동안 하루에 12시간 이상씩 개발하고 공부했습니다. 15개 이상의 프로젝트를 진행했으며 8개 이상의 수상을 이뤘습니다. 이러한 경험은 기업의 어떤 직무 수행에도 도움이 될 수 있다고 생각합니다. 

다양한 배경에서 개발해 본 것도 도움이 된다고 생각합니다. 개발 마감 시간과 환경적인 관점에서 저는 다양한 경험을 가지고 있습니다. 3일 안에 개발해야 하는 해커톤 대회, 3개월에서 6개월 정도의 중장기 소프트웨어 경진대회, 연구실에서 진행하는 1년 이상의 기업 연계 프로젝트 등을 참여했습니다.

환경적인 관점에서도, 창업 대회에서 심사위원에게 제품을 심사본 경험이 있고, 차량과 앉아 CAN 통신을 하면서 라즈베리파이의 소프트웨어를 개발한 경험, 물 위에 수상정을 놓고 개발한 경험, 시뮬레이션을 통한 개발 등의 경험도 있습니다.

하나의 프로젝트에도 수많은 문제와 고뇌가 있었고, 그런 프로젝트를 꾸준하게 진행했습니다. 제가 프로젝트를 통해 쌓은 수많은 경험은 한화시스템의 다양한 프로젝트에 빠르게 적응하고 도움이 될 수 있도록 할 것입니다.